In [7]:
cd D:\\Arman\Dokkho Cohort 4 Course Materials\Data Analysis Project\2022-T-20-Cricket-Tournament-Analysis\project folder

D:\Arman\Dokkho Cohort 4 Course Materials\Data Analysis Project\2022-T-20-Cricket-Tournament-Analysis\project folder

In [8]:
import numpy as np
import pandas as pd

### Batsman Summary

In [9]:
df = pd.read_csv('batsman_summary_updated.csv')
df.head()

        Batsman Name  Runs  Balls  4s  6s Strike Rates
0  Mohammad Rizwan †    15     14   0   1       107.14
1     Babar Azam (c)    32     28   2   0       114.28
2     Mohammad Haris     8     12   1   0        66.66
3        Shan Masood    38     28   2   1       135.71
4     Iftikhar Ahmed     0      6   0   0         0.00

In [10]:
df.isnull().sum()

Batsman Name    0
Runs            0
Balls           0
4s              0
6s              0
Strike Rates    0
dtype: int64

In [11]:
df.tail()

            Batsman Name  Runs  Balls  4s  6s Strike Rates
694    Wanindu Hasaranga     4      8   0   0        50.00
695  Chamika Karunaratne     5      8   0   0        62.50
696      Pramod Madushan     0      0   0   0            -
697  Dushmantha Chameera     8     15   0   0        53.33
698   Maheesh Theekshana    11     11   0   1       100.00

In [13]:
type(df['Strike Rates'].values)

numpy.ndarray

In [16]:
df['Strike Rates'].replace('-',0,inplace=True)

In [17]:
df.tail()

            Batsman Name  Runs  Balls  4s  6s Strike Rates
694    Wanindu Hasaranga     4      8   0   0        50.00
695  Chamika Karunaratne     5      8   0   0        62.50
696      Pramod Madushan     0      0   0   0            0
697  Dushmantha Chameera     8     15   0   0        53.33
698   Maheesh Theekshana    11     11   0   1       100.00

In [18]:
df.isnull().sum()

Batsman Name    0
Runs            0
Balls           0
4s              0
6s              0
Strike Rates    0
dtype: int64

In [19]:
df.shape

(699, 6)

In [20]:
df.to_csv('new_batsman_updated_summary.csv',index=False)

### Bowler Summary

In [21]:
df1 = pd.read_csv('bowler_summary_updated.csv')
df1.head()

,Bowler Name,Overs,Maiden,Runs,Wickets,Economy,0s,4s,6s,Wides,No Balls
0,Ben Stokes,4.0,0,32,1,8.00,6,1,0,2,1
1,Chris Woakes,3.0,0,26,0,8.66,7,2,1,2,0
2,Sam Curran,4.0,0,12,3,3.00,15,0,0,0,0
3,Adil Rashid,4.0,1,22,2,5.50,10,1,0,1,0
4,Chris Jordan,4.0,0,27,2,6.75,9,3,0,0,0

In [22]:
df1.shape

(500, 11)

In [23]:
df1.isnull().sum()

Bowler Name    0
Overs          0
Maiden         0
Runs           0
Wickets        0
Economy        0
0s             0
4s             0
6s             0
Wides          0
No Balls       0
dtype: int64

In [24]:
df1['Extras'] = df1['Wides'] + df1['No Balls']

In [25]:
df1.head()

,Bowler Name,Overs,Maiden,Runs,Wickets,Economy,0s,4s,6s,Wides,No Balls,Extras
0,Ben Stokes,4.0,0,32,1,8.00,6,1,0,2,1,3
1,Chris Woakes,3.0,0,26,0,8.66,7,2,1,2,0,2
2,Sam Curran,4.0,0,12,3,3.00,15,0,0,0,0,0
3,Adil Rashid,4.0,1,22,2,5.50,10,1,0,1,0,1
4,Chris Jordan,4.0,0,27,2,6.75,9,3,0,0,0,0

In [27]:
df1.drop(['Wides','No Balls'],axis=1,inplace=True)
df1.head()

    Bowler Name  Overs  Maiden  Runs  Wickets  Economy  0s  4s  6s  Extras
0    Ben Stokes    4.0       0    32        1     8.00   6   1   0       3
1  Chris Woakes    3.0       0    26        0     8.66   7   2   1       2
2    Sam Curran    4.0       0    12        3     3.00  15   0   0       0
3   Adil Rashid    4.0       1    22        2     5.50  10   1   0       1
4  Chris Jordan    4.0       0    27        2     6.75   9   3   0       0

In [28]:
df1.to_csv('new_bowler_updated_summary.csv',index=False)